Repository: Burkhanovich/article_site
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: Article Publishing Platform
ru: Платформа публикации статей
uz: Maqola Nashri Platformasi

source: Home
ru: Главная
uz: Bosh sahifa

source: Articles
ru: Статьи
uz: Maqolalar

source: Dashboard
ru: Панель управления
uz: Boshqaruv paneli

source: My Articles
ru: Мои статьи
uz: Mening maqolalarim

source: Create Article
ru: Создать статью
uz: Maqola yaratish

source: Login
ru: Вход
uz: Kirish

source: Register
ru: Регистрация
uz: Ro'yxatdan o'tish

source: Logout
ru: Выход
uz: Chiqish

source: O'quvchi (Reader)
ru: Читатель
uz: O'quvchi

source: Avtor (Author)
ru: Автор
uz: Avtor

source: User Role
ru: Роль пользователя
uz: Foydalanuvchi roli

source: Reader
ru: Читатель
uz: O'quvchi

source: Author
ru: Автор
uz: Avtor

source: Username
ru: Имя пользователя
uz: Foydalanuvchi nomi

source: Email
ru: Электронная почта
uz: Elektron pochta

source: email address
ru: адрес электронной почты
uz: elektron pochta manzili

source: Password
ru: Пароль
uz: Parol

source: Confirm Password
ru: Подтвердите пароль
uz: Parolni tasdiqlang

source: Role
ru: Роль
uz: Rol

source: Title
ru: Заголовок
uz: Sarlavha

source: Content
ru: Содержание
uz: Kontent

source: Cover Image
ru: Обложка
uz: Muqova rasmi

source: Status
ru: Статус
uz: Holat

source: Draft
ru: Черновик
uz: Qoralama

source: Published
ru: Опубликовано
uz: Nashr etilgan

source: Slug
ru: URL имя
uz: URL nomi

source: Views
ru: Просмотры
uz: Ko'rishlar

source: Created At
ru: Дата создания
uz: Yaratilgan sana

source: Updated At
ru: Дата обновления
uz: Yangilangan sana

source: Article Rules
ru: Правила статей
uz: Maqola qoidalari

source: Rules Content
ru: Текст правил
uz: Qoidalar matni

source: Article writing guidelines that authors must accept
ru: Правила написания статей, которые должны принять авторы
uz: Mualliflar qabul qilishi kerak bo'lgan maqola yozish qoidalari

source: Active
ru: Активно
uz: Faol

source: Only one set of rules should be active at a time
ru: Только один набор правил должен быть активным одновременно
uz: Bir vaqtning o'zida faqat bitta qoidalar to'plami faol bo'lishi kerak

source: Has Accepted Article Rules
ru: Принял правила статей
uz: Maqola qoidalarini qabul qildi

source: Submit
ru: Отправить
uz: Yuborish

source: Save
ru: Сохранить
uz: Saqlash

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Delete
ru: Удалить
uz: O'chirish

source: Edit
ru: Редактировать
uz: Tahrirlash

source: View
ru: Просмотр
uz: Ko'rish

source: Search
ru: Поиск
uz: Qidirish

source: Accept Rules
ru: Принять правила
uz: Qoidalarni qabul qilish

source: I accept the article writing rules
ru: Я принимаю правила написания статей
uz: Men maqola yozish qoidalarini qabul qilaman

source: Create Account
ru: Создать аккаунт
uz: Hisob yaratish

source: Sign In
ru: Войти
uz: Tizimga kirish

source: Sign Up
ru: Зарегистрироваться
uz: Ro'yxatdan o'tish

source: Back
ru: Назад
uz: Orqaga

source: Next
ru: Следующий
uz: Keyingi

source: Previous
ru: Предыдущий
uz: Oldingi

source: Welcome
ru: Добро пожаловать
uz: Xush kelibsiz

source: Welcome back
ru: С возвращением
uz: Qaytib kelganingizdan xursandmiz

source: Thank you
ru: Спасибо
uz: Rahmat

source: Success
ru: Успешно
uz: Muvaffaqiyatli

source: Error
ru: Ошибка
uz: Xato

source: Warning
ru: Предупреждение
uz: Ogohlantirish

source: Info
ru: Информация
uz: Ma'lumot

source: Welcome, {username}! Your account has been created successfully.
ru: Добро пожаловать, {username}! Ваш аккаунт успешно создан.
uz: Xush kelibsiz, {username}! Hisobingiz muvaffaqiyatli yaratildi.

source: As an author, you must read and accept our article writing rules before publishing.
ru: Как автор, вы должны прочитать и принять наши правила написания статей перед публикацией.
uz: Muallif sifatida siz nashr etishdan oldin maqola yozish qoidalarimizni o'qib, qabul qilishingiz kerak.

source: Registration failed. Please correct the errors below.
ru: Регистрация не удалась. Пожалуйста, исправьте ошибки ниже.
uz: Ro'yxatdan o'tish muvaffaqiyatsiz tugadi. Quyidagi xatolarni tuzating.

source: Invalid username or password. Please try again.
ru: Неверное имя пользователя или пароль. Попробуйте снова.
uz: Noto'g'ri foydalanuvchi nomi yoki parol. Qayta urinib ko'ring.

source: You have been logged out successfully.
ru: Вы успешно вышли из системы.
uz: Tizimdan muvaffaqiyatli chiqdingiz.

source: Access denied. This page is only for authors.
ru: Доступ запрещен. Эта страница только для авторов.
uz: Kirish rad etildi. Bu sahifa faqat mualliflar uchun.

source: Article rules have not been configured yet. Please contact the administrator.
ru: Правила статей еще не настроены. Пожалуйста, свяжитесь с администратором.
uz: Maqola qoidalari hali sozlanmagan. Iltimos, administrator bilan bog'laning.

source: Thank you for accepting the rules! You can now create articles.
ru: Спасибо за принятие правил! Теперь вы можете создавать статьи.
uz: Qoidalarni qabul qilganingiz uchun rahmat! Endi maqolalar yaratishingiz mumkin.

source: You must accept the rules to proceed.
ru: Вы должны принять правила для продолжения.
uz: Davom etish uchun qoidalarni qabul qilishingiz kerak.

source: Please accept the article writing rules to start publishing.
ru: Пожалуйста, примите правила написания статей, чтобы начать публикацию.
uz: Nashr etishni boshlash uchun maqola yozish qoidalarini qabul qiling.

source: Please log in to access this page.
ru: Пожалуйста, войдите в систему для доступа к этой странице.
uz: Ushbu sahifaga kirish uchun tizimga kiring.

source: Access denied. Only authors can create articles.
ru: Доступ запрещен. Только авторы могут создавать статьи.
uz: Kirish rad etildi. Faqat mualliflar maqola yaratishi mumkin.

source: You must accept the article writing rules before creating articles.
ru: Вы должны принять правила написания статей перед созданием статей.
uz: Maqola yaratishdan oldin maqola yozish qoidalarini qabul qilishingiz kerak.

source: Access denied. You can only edit your own articles.
ru: Доступ запрещен. Вы можете редактировать только свои статьи.
uz: Kirish rad etildi. Faqat o'z maqolalaringizni tahrirlashingiz mumkin.

source: Access denied. You can only delete your own articles.
ru: Доступ запрещен. Вы можете удалять только свои статьи.
uz: Kirish rad etildi. Faqat o'z maqolalaringizni o'chirishingiz mumkin.

source: Article "{title}" created successfully!
ru: Статья "{title}" успешно создана!
uz: "{title}" maqolasi muvaffaqiyatli yaratildi!

source: Failed to create article. Please correct the errors below.
ru: Не удалось создать статью. Пожалуйста, исправьте ошибки ниже.
uz: Maqola yaratilmadi. Quyidagi xatolarni tuzating.

source: Article "{title}" updated successfully!
ru: Статья "{title}" успешно обновлена!
uz: "{title}" maqolasi muvaffaqiyatli yangilandi!

source: Failed to update article. Please correct the errors below.
ru: Не удалось обновить статью. Пожалуйста, исправьте ошибки ниже.
uz: Maqola yangilanmadi. Quyidagi xatolarni tuzating.

source: Article "{title}" has been deleted successfully.
ru: Статья "{title}" успешно удалена.
uz: "{title}" maqolasi muvaffaqiyatli o'chirildi.

source: Article title (max 200 characters)
ru: Заголовок статьи (максимум 200 символов)
uz: Maqola sarlavhasi (maksimal 200 belgi)

source: Auto-generated from title, used in URLs
ru: Автоматически создается из заголовка, используется в URL
uz: Sarlavhadan avtomatik yaratiladi, URL manzillarida ishlatiladi

source: Article content with rich text formatting
ru: Содержание статьи с форматированным текстом
uz: Boy matn formatlash bilan maqola kontenti

source: Allowed formats: jpg, jpeg, png, gif, webp. Max size: 5MB
ru: Разрешенные форматы: jpg, jpeg, png, gif, webp. Макс. размер: 5МБ
uz: Ruxsat etilgan formatlar: jpg, jpeg, png, gif, webp. Maksimal hajm: 5MB

source: Number of times this article has been viewed
ru: Количество просмотров этой статьи
uz: Bu maqola ko'rilgan sonlar

source: Total Articles
ru: Всего статей
uz: Jami maqolalar

source: Published Articles
ru: Опубликованные статьи
uz: Nashr etilgan maqolalar

source: Draft Articles
ru: Черновики
uz: Qoralama maqolalar

source: Recent Articles
ru: Последние статьи
uz: So'nggi maqolalar

source: Total
ru: Всего
uz: Jami

source: Statistics
ru: Статистика
uz: Statistika

source: Total views
ru: Всего просмотров
uz: Jami ko'rishlar

source: 403 - Access Denied
ru: 403 - Доступ запрещен
uz: 403 - Kirish rad etildi

source: Access Denied
ru: Доступ запрещен
uz: Kirish rad etildi

source: You don't have permission to access this resource.
ru: У вас нет разрешения на доступ к этому ресурсу.
uz: Sizda ushbu manbaga kirish huquqi yo'q.

source: If you believe this is an error, please contact the administrator.
ru: Если вы считаете, что это ошибка, свяжитесь с администратором.
uz: Agar bu xato deb hisoblasangiz, administrator bilan bog'laning.

source: Go to Homepage
ru: Перейти на главную
uz: Bosh sahifaga o'tish

source: Go to Dashboard
ru: Перейти к панели управления
uz: Boshqaruv paneliga o'tish

source: 404 - Page Not Found
ru: 404 - Страница не найдена
uz: 404 - Sahifa topilmadi

source: Page Not Found
ru: Страница не найдена
uz: Sahifa topilmadi

source: The page you are looking for doesn't exist or has been moved.
ru: Страница, которую вы ищете, не существует или была перемещена.
uz: Siz qidirayotgan sahifa mavjud emas yoki ko'chirilgan.

source: Please check the URL or use the navigation to find what you're looking for.
ru: Пожалуйста, проверьте URL или используйте навигацию, чтобы найти то, что вы ищете.
uz: URL manzilini tekshiring yoki qidirayotgan narsangizni topish uchun navigatsiyadan foydalaning.

source: Browse Articles
ru: Просмотреть статьи
uz: Maqolalarni ko'rish

source: 500 - Server Error
ru: 500 - Ошибка сервера
uz: 500 - Server xatosi

source: Internal Server Error
ru: Внутренняя ошибка сервера
uz: Ichki server xatosi

source: Something went wrong on our end. We're working to fix it.
ru: Что-то пошло не так с нашей стороны. Мы работаем над исправлением.
uz: Bizning tomonimizda xatolik yuz berdi. Uni tuzatish ustida ishlayapmiz.

source: Please try again later. If the problem persists, contact support.
ru: Пожалуйста, попробуйте позже. Если проблема сохраняется, обратитесь в поддержку.
uz: Keyinroq qayta urinib ko'ring. Agar muammo davom etsa, qo'llab-quvvatlash xizmatiga murojaat qiling.

source: Try Again
ru: Попробовать снова
uz: Qayta urinish

source: Built with Django & Bootstrap
ru: Создано с Django и Bootstrap
uz: Django va Bootstrap bilan qurilgan

source: Secure
ru: Безопасно
uz: Xavfsiz

source: Scalable
ru: Масштабируемо
uz: Kengaytirilishi mumkin

source: Production-Ready
ru: Готово к производству
uz: Ishlab chiqarishga tayyor

source: This field is required.
ru: Это поле обязательно для заполнения.
uz: Bu maydon to'ldirilishi shart.

source: Enter a valid email address.
ru: Введите действительный адрес электронной почты.
uz: To'g'ri elektron pochta manzilini kiriting.

source: A user with that email already exists.
ru: Пользователь с таким адресом электронной почты уже существует.
uz: Ushbu elektron pochta bilan foydalanuvchi allaqachon mavjud.

source: The two password fields didn't match.
ru: Два поля пароля не совпадают.
uz: Ikki parol maydoni mos kelmadi.

source: This password is too short. It must contain at least 8 characters.
ru: Этот пароль слишком короткий. Он должен содержать не менее 8 символов.
uz: Bu parol juda qisqa. U kamida 8 ta belgidan iborat bo'lishi kerak.

source: This password is too common.
ru: Этот пароль слишком распространен.
uz: Bu parol juda oddiy.

source: This password is entirely numeric.
ru: Этот пароль полностью состоит из цифр.
uz: Bu parol butunlay raqamlardan iborat.

source: User
ru: Пользователь
uz: Foydalanuvchi

source: Users
ru: Пользователи
uz: Foydalanuvchilar

source: Article
ru: Статья
uz: Maqola

source: Page
ru: Страница
uz: Sahifa

source: of
ru: из
uz: dan

source: Showing
ru: Показано
uz: Ko'rsatilmoqda

source: results
ru: результатов
uz: natija

source: Are you sure?
ru: Вы уверены?
uz: Ishonchingiz komilmi?

source: Are you sure you want to delete this article?
ru: Вы действительно хотите удалить эту статью?
uz: Haqiqatan ham bu maqolani o'chirmoqchimisiz?

source: This action cannot be undone.
ru: Это действие нельзя отменить.
uz: Bu amalni bekor qilib bo'lmaydi.

source: Yes, delete it
ru: Да, удалить
uz: Ha, o'chirish

source: No, cancel
ru: Нет, отменить
uz: Yo'q, bekor qilish

source: Today
ru: Сегодня
uz: Bugun

source: Yesterday
ru: Вчера
uz: Kecha

source: days ago
ru: дней назад
uz: kun oldin

source: hours ago
ru: часов назад
uz: soat oldin

source: minutes ago
ru: минут назад
uz: daqiqa oldin

source: just now
ru: только что
uz: hozir

source: My Dashboard
ru: Моя панель
uz: Mening paneliim

source: Article Management
ru: Управление статьями
uz: Maqolalarni boshqarish

source: Quick Actions
ru: Быстрые действия
uz: Tezkor harakatlar

source: No articles yet
ru: Пока нет статей
uz: Hali maqolalar yo'q

source: Start by creating your first article!
ru: Начните с создания вашей первой статьи!
uz: Birinchi maqolangizni yaratish bilan boshlang!

source: Search articles...
ru: Искать статьи...
uz: Maqolalarni qidirish...

source: Search results for
ru: Результаты поиска для
uz: Qidiruv natijalari

source: No results found
ru: Ничего не найдено
uz: Hech narsa topilmadi

source: Try different keywords
ru: Попробуйте другие ключевые слова
uz: Boshqa kalit so'zlarni sinab ko'ring

source: Choose file
ru: Выбрать файл
uz: Fayl tanlash

source: No file chosen
ru: Файл не выбран
uz: Hech qanday fayl tanlanmadi

source: Upload
ru: Загрузить
uz: Yuklash

source: Remove
ru: Удалить
uz: Olib tashlash

source: Enter your username
ru: Введите ваше имя пользователя
uz: Foydalanuvchi nomingizni kiriting

source: Enter your email address
ru: Введите ваш адрес электронной почты
uz: Elektron pochta manzilingizni kiriting

source: Enter your password
ru: Введите ваш пароль
uz: Parolingizni kiriting

source: Confirm your password
ru: Подтвердите ваш пароль
uz: Parolingizni tasdiqlang

source: Choose your role
ru: Выберите вашу роль
uz: Rolingizni tanlang

source: Select a language
ru: Выберите язык
uz: Tilni tanlang

source: Upload New Article
ru: Загрузить новую статью
uz: Yangi maqola yuklash

source: Your Articles
ru: Ваши статьи
uz: Sizning maqolalaringiz

source: Platform Total
ru: Всего на платформе
uz: Platformada jami

source: Articles Available to Read
ru: Доступно статей для чтения
uz: O'qish uchun mavjud maqolalar

source: Discover amazing articles from talented authors
ru: Откройте для себя удивительные статьи от талантливых авторов
uz: Iqtidorli mualliflarning ajoyib maqolalarini kashf eting

source: You are registered as a Reader. Browse and enjoy articles!
ru: Вы зарегистрированы как Читатель. Просматривайте и наслаждайтесь статьями!
uz: Siz O'quvchi sifatida ro'yxatdan o'tgansiz. Maqolalarni ko'rib, bahramand bo'ling!

source: Browse All Articles
ru: Просмотреть все статьи
uz: Barcha maqolalarni ko'rish

source: Ready to share your knowledge? Create your next article now!
ru: Готовы поделиться знаниями? Создайте вашу следующую статью прямо сейчас!
uz: Bilimlaringizni baham ko'rishga tayyormisiz? Keyingi maqolangizni hozir yarating!

source: Action Required
ru: Требуется действие
uz: Harakat talab qilinadi

source: Accept Rules Now
ru: Принять правила сейчас
uz: Qoidalarni hozir qabul qilish

source: Create New Article
ru: Создать новую статью
uz: Yangi maqola yaratish

source: Your Recent Articles
ru: Ваши последние статьи
uz: Sizning so'nggi maqolalaringiz

source: Actions
ru: Действия
uz: Harakatlar

source: Created
ru: Создано
uz: Yaratilgan

source: View All My Articles
ru: Просмотреть все мои статьи
uz: Barcha maqolalarimni ko'rish

source: You haven't created any articles yet.
ru: Вы еще не создали ни одной статьи.
uz: Siz hali birorta maqola yaratmagansiz.

source: Create your first article
ru: Создайте вашу первую статью
uz: Birinchi maqolangizni yarating

source: Reader Account
ru: Аккаунт читателя
uz: O'quvchi akkaunti

source: You are registered as a Reader. You can browse and read all published articles.
ru: Вы зарегистрированы как Читатель. Вы можете просматривать и читать все опубликованные статьи.
uz: Siz O'quvchi sifatida ro'yxatdan o'tgansiz. Barcha nashr etilgan maqolalarni ko'rib chiqishingiz va o'qishingiz mumkin.

source: To create articles, you need to register as an Author.
ru: Чтобы создавать статьи, вам нужно зарегистрироваться как Автор.
uz: Maqola yaratish uchun Muallif sifatida ro'yxatdan o'tishingiz kerak.

source: No articles available yet. Check back later!
ru: Пока нет доступных статей. Зайдите позже!
uz: Hali maqolalar mavjud emas. Keyinroq tekshiring!

source: Why Choose Our Platform?
ru: Почему стоит выбрать нашу платформу?
uz: Nega bizning platformani tanlash kerak?

source: Easy Publishing
ru: Легкая публикация
uz: Oson nashr etish

source: Rich text editor with image support makes writing a breeze.
ru: Редактор с форматированным текстом и поддержкой изображений делает написание легким.
uz: Rasm qo'llab-quvvatlaydigan boy matn muharriri yozishni osonlashtiradi.

source: Secure & Safe
ru: Безопасно и надежно
uz: Xavfsiz va ishonchli

source: Your content is protected with enterprise-grade security.
ru: Ваш контент защищен системой безопасности корпоративного уровня.
uz: Kontentingiz korxona darajasidagi xavfsizlik bilan himoyalangan.

source: Track Performance
ru: Отслеживание эффективности
uz: Samaradorlikni kuzatish

source: Monitor views and engagement on your articles.
ru: Отслеживайте просмотры и вовлеченность ваших статей.
uz: Maqolalaringizdagi ko'rishlar va faoliyatni kuzatib boring.

source: No articles published yet. Be the first to share your knowledge!
ru: Пока нет опубликованных статей. Станьте первым, кто поделится знаниями!
uz: Hali hech qanday maqola nashr etilmagan. Bilimlaringizni baham ko'rgan birinchi odam bo'ling!

source: View All Articles
ru: Просмотреть все статьи
uz: Barcha maqolalarni ko'rish

source: Read Article
ru: Читать статью
uz: Maqolani o'qish

source: Join as Author
ru: Присоединиться как автор
uz: Muallif sifatida qo'shilish

source: Community Driven
ru: Управляется сообществом
uz: Jamiyat tomonidan boshqariladigan

source: Secure Platform
ru: Безопасная платформа
uz: Xavfsiz platforma

source: Welcome to Article Platform
ru: Добро пожаловать на платформу статей
uz: Maqola platformasiga xush kelibsiz

source: Share your knowledge, read amazing articles, and connect with authors worldwide.
ru: Делитесь знаниями, читайте удивительные статьи и общайтесь с авторами по всему миру.
uz: Bilimlaringizni baham ko'ring, ajoyib maqolalarni o'qing va dunyo bo'ylab mualliflar bilan bog'laning.

source: views
ru: просмотров
uz: ko'rishlar

source: You need to read and accept our article writing rules before you can start publishing.
ru: Вам нужно прочитать и принять наши правила написания статей, прежде чем вы сможете начать публикацию.
uz: Nashr etishni boshlashdan oldin maqola yozish qoidalarimizni o'qib, qabul qilishingiz kerak.

source: Article Title
ru: Заголовок Статьи
uz: Maqola Sarlavhasi

source: Article Content
ru: Содержание Статьи
uz: Maqola Kontenti

source: Article File
ru: Файл Статьи
uz: Maqola Fayli

source: Maximum 200 characters
ru: Максимум 200 символов
uz: Maksimal 200 belgi

source: Write your article content with rich text formatting
ru: Напишите содержание статьи с форматированным текстом
uz: Maqolangiz kontentini boy matn formatlash bilan yozing

source: Upload article as file. Allowed formats: TXT, DOC, DOCX, PDF. Maximum size: 10MB
ru: Загрузите статью как файл. Разрешенные форматы: TXT, DOC, DOCX, PDF. Максимальный размер: 10МБ
uz: Maqolani fayl sifatida yuklang. Ruxsat etilgan formatlar: TXT, DOC, DOCX, PDF. Maksimal hajm: 10MB

source: Choose "Draft" to save without publishing, or "Published" to make it visible to readers
ru: Выберите "Черновик" для сохранения без публикации или "Опубликовано" чтобы сделать видимым для читателей
uz: "Qoralama" ni tanlang nashr etmasdan saqlash uchun, yoki "Nashr etilgan" ni tanlang o'quvchilarga ko'rinishi uchun

source: Optional
ru: Необязательно
uz: Ixtiyoriy

source: Current file
ru: Текущий файл
uz: Joriy fayl

source: Type
ru: Тип
uz: Turi

source: Size
ru: Размер
uz: Hajmi

source: Update Article
ru: Обновить Статью
uz: Maqolani Yangilash

source: Writing Tips
ru: Советы по Написанию
uz: Yozish Maslahatlari

source: Use a clear, descriptive title that summarizes your article
ru: Используйте четкий, описательный заголовок, который обобщает вашу статью
uz: Maqolangizni umumlashtiruvchi aniq, tavsifiy sarlavhadan foydalaning

source: Add a cover image to make your article more attractive (optional but recommended)
ru: Добавьте обложку, чтобы сделать статью более привлекательной (необязательно, но рекомендуется)
uz: Maqolangizni jozibador qilish uchun muqova rasmini qo'shing (ixtiyoriy, ammo tavsiya etiladi)

source: Upload your article as a file (TXT, DOC, DOCX, or PDF) if you prefer (optional)
ru: Загрузите статью как файл (TXT, DOC, DOCX или PDF), если хотите (необязательно)
uz: Agar xohlasangiz maqolangizni fayl sifatida yuklang (TXT, DOC, DOCX, yoki PDF) (ixtiyoriy)

source: Format your content with headings, lists, and images for better readability
ru: Форматируйте содержание с заголовками, списками и изображениями для лучшей читаемости
uz: Yaxshi o'qilishi uchun kontentingizni sarlavhalar, ro'yxatlar va rasmlar bilan formatlang

source: Save as Draft if you want to continue editing later
ru: Сохраните как черновик, если хотите продолжить редактирование позже
uz: Keyinroq tahrirlashni davom ettirish uchun Qoralama sifatida saqlang

source: Publish when your article is ready for readers
ru: Опубликуйте, когда ваша статья готова для читателей
uz: Maqolangiz o'quvchilar uchun tayyor bo'lganda nashr eting

source: Download Article File
ru: Скачать Файл Статьи
uz: Maqola Faylini Yuklash

source: Open article file
ru: Открыть файл статьи
uz: Maqola faylini ochish

source: Article File Available
ru: Файл Статьи Доступен
uz: Maqola Fayli Mavjud

source: File Type
ru: Тип Файла
uz: Fayl Turi

source: Open File
ru: Открыть Файл
uz: Faylni Ochish

source: Download
ru: Скачать
uz: Yuklash

source: Back to Articles
ru: Вернуться к Статьям
uz: Maqolalarga Qaytish

source: Browse our collection of amazing articles
ru: Просмотрите нашу коллекцию замечательных статей
uz: Bizning ajoyib maqolalar to'plamini ko'ring

source: Showing results for
ru: Показаны результаты для
uz: Qidiruv natijalari

source: Clear
ru: Очистить
uz: Tozalash

source: Last updated
ru: Последнее обновление
uz: Oxirgi yangilanish

source: About the Author
ru: Об Авторе
uz: Muallif Haqida

source: Search by title, author, or content...
ru: Поиск по заголовку, автору или содержанию...
uz: Sarlavha, muallif yoki kontent bo'yicha qidiring...

source: Pending Review
ru: На рассмотрении
uz: Ko'rib chiqish kutilmoqda

source: Rejected
ru: Отклонено
uz: Rad etildi

source: Submit for Review
ru: Отправить на проверку
uz: Ko'rib chiqishga yuborish

source: Save as Draft
ru: Сохранить как черновик
uz: Qoralama sifatida saqlash

source: Submitted on
ru: Отправлено
uz: Yuborilgan sana

source: Reviewed on
ru: Проверено
uz: Ko'rib chiqilgan sana

source: by
ru: кем
uz: tomonidan

source: Reason
ru: Причина
uz: Sabab

source: Rejection Reason
ru: Причина отклонения
uz: Rad etish sababi

source: Article Rejected
ru: Статья отклонена
uz: Maqola rad etildi

source: No specific reason was provided. Please review your article and make necessary improvements before resubmitting.
ru: Конкретная причина не указана. Пожалуйста, просмотрите свою статью и внесите необходимые изменения перед повторной отправкой.
uz: Aniq sabab ko'rsatilmagan. Iltimos, maqolangizni ko'rib chiqing va qayta yuborishdan oldin zarur o'zgartirishlarni kiriting.
