Repository: Burkhanovich/article_site
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: This article is saved as a draft and is only visible to you.
ru: Эта статья сохранена как черновик и видна только вам.
uz: Bu maqola qoralama sifatida saqlangan va faqat sizga ko'rinadi.

source: Edit and submit for review
ru: Редактировать и отправить на проверку
uz: Tahrirlash va ko'rib chiqishga yuborish

source: This article is awaiting admin approval and cannot be edited.
ru: Эта статья ожидает одобрения администратора и не может быть отредактирована.
uz: Bu maqola administrator tasdig'ini kutmoqda va tahrirlab bo'lmaydi.

source: Edit and Resubmit
ru: Редактировать и отправить повторно
uz: Tahrirlash va qayta yuborish

source: You cannot edit this article while it is pending review.
ru: Вы не можете редактировать эту статью, пока она находится на проверке.
uz: Ko'rib chiqish davomida bu maqolani tahrirlay olmaysiz.

source: Article Submission Guide
ru: Руководство по отправке статей
uz: Maqola yuborish qo'llanmasi

source: Saves your article without submitting for review
ru: Сохраняет статью без отправки на проверку
uz: Maqolangizni ko'rib chiqishga yubormasdan saqlaydi

source: You can continue editing anytime
ru: Вы можете продолжить редактирование в любое время
uz: Istalgan vaqtda tahrirlashni davom ettirishingiz mumkin

source: Only visible to you
ru: Видна только вам
uz: Faqat sizga ko'rinadi

source: Sends your article to admin for approval
ru: Отправляет статью администратору на одобрение
uz: Maqolangizni tasdiqlash uchun administratorga yuboradi

source: Cannot edit while under review
ru: Нельзя редактировать во время проверки
uz: Ko'rib chiqish davomida tahrirlash mumkin emas

source: Will be published after approval
ru: Будет опубликована после одобрения
uz: Tasdiqlangandan so'ng nashr etiladi

source: If rejected, you can edit and resubmit
ru: Если отклонена, вы можете отредактировать и отправить повторно
uz: Rad etilsa, tahrirlash va qayta yuborishingiz mumkin

source: Article "%(title)s" has been submitted for review. You will be notified once it is reviewed.
ru: Статья "%(title)s" отправлена на проверку. Вы получите уведомление после проверки.
uz: "%(title)s" maqolasi ko'rib chiqishga yuborildi. Ko'rib chiqilganda sizga xabar beriladi.

source: Article "%(title)s" saved as draft.
ru: Статья "%(title)s" сохранена как черновик.
uz: "%(title)s" maqolasi qoralama sifatida saqlandi.

source: Article "%(title)s" has been submitted for review.
ru: Статья "%(title)s" отправлена на проверку.
uz: "%(title)s" maqolasi ko'rib chiqishga yuborildi.

source: Article "%(title)s" updated and saved as draft.
ru: Статья "%(title)s" обновлена и сохранена как черновик.
uz: "%(title)s" maqolasi yangilandi va qoralama sifatida saqlandi.

source: Please log in to edit articles.
ru: Пожалуйста, войдите в систему, чтобы редактировать статьи.
uz: Maqolalarni tahrirlash uchun tizimga kiring.

source: This article cannot be edited. Only draft or rejected articles can be modified.
ru: Эта статья не может быть отредактирована. Можно изменять только черновики или отклонённые статьи.
uz: Bu maqolani tahrirlash mumkin emas. Faqat qoralama yoki rad etilgan maqolalarni o'zgartirish mumkin.

source: You cannot submit this article for review.
ru: Вы не можете отправить эту статью на проверку.
uz: Bu maqolani ko'rib chiqishga yuborolmaysiz.

source: This article cannot be submitted for review.
ru: Эта статья не может быть отправлена на проверку.
uz: Bu maqolani ko'rib chiqishga yuborib bo'lmaydi.

source: Drafts
ru: Черновики
uz: Qoralamalar

source: Pending
ru: Ожидает
uz: Kutilmoqda

source: All
ru: Все
uz: Hammasi

source: article(s) rejected. Please review and resubmit.
ru: статей отклонено. Проверьте и отправьте повторно.
uz: ta maqola rad etildi. Ko'rib chiqing va qayta yuboring.

source: View Rejected
ru: Просмотреть отклонённые
uz: Rad etilganlarni ko'rish

source: No articles found with this status.
ru: Статьи с таким статусом не найдены.
uz: Bu holatda maqolalar topilmadi.

source: Article Status Guide
ru: Руководство по статусам статей
uz: Maqola holati qo'llanmasi

source: Saved for later editing. Only visible to you.
ru: Сохранено для дальнейшего редактирования. Видно только вам.
uz: Keyinroq tahrirlash uchun saqlangan. Faqat sizga ko'rinadi.

source: Submitted and awaiting admin review.
ru: Отправлено и ожидает проверки администратором.
uz: Yuborilgan va administrator ko'rib chiqishini kutmoqda.

source: Approved and visible to all readers.
ru: Одобрено и видно всем читателям.
uz: Tasdiqlangan va barcha o'quvchilarga ko'rinadi.

source: Needs revision. You can edit and resubmit.
ru: Требуется доработка. Вы можете отредактировать и отправить повторно.
uz: Qayta ko'rib chiqish kerak. Tahrirlash va qayta yuborishingiz mumkin.

source: Confirm Deletion
ru: Подтвердите удаление
uz: O'chirishni tasdiqlash

source: This action cannot be undone. The article and all associated files will be permanently deleted.
ru: Это действие нельзя отменить. Статья и все связанные файлы будут удалены навсегда.
uz: Bu amalni bekor qilib bo'lmaydi. Maqola va barcha tegishli fayllar butunlay o'chiriladi.

source: Article to be deleted
ru: Статья для удаления
uz: O'chiriladigan maqola

source: Yes, Delete Article
ru: Да, удалить статью
uz: Ha, maqolani o'chirish

source: Delete Article
ru: Удалить статью
uz: Maqolani o'chirish

source: Submitted At
ru: Время отправки
uz: Yuborilgan vaqt

source: Reviewed At
ru: Время проверки
uz: Ko'rib chiqilgan vaqt

source: Reviewed By
ru: Проверено
uz: Ko'rib chiquvchi

source: When the article was submitted for review
ru: Когда статья была отправлена на проверку
uz: Maqola ko'rib chiqishga yuborilgan vaqt

source: When the article was reviewed by admin
ru: Когда статья была проверена администратором
uz: Maqola administrator tomonidan ko'rib chiqilgan vaqt

source: Admin who reviewed this article
ru: Администратор, проверивший эту статью
uz: Bu maqolani ko'rib chiqqan administrator

source: Reason for rejection (if rejected)
ru: Причина отклонения (если отклонена)
uz: Rad etish sababi (agar rad etilgan bo'lsa)

source: Article not found.
ru: Статья не найдена.
uz: Maqola topilmadi.

source: Approve selected articles
ru: Одобрить выбранные статьи
uz: Tanlangan maqolalarni tasdiqlash

source: Reject selected articles
ru: Отклонить выбранные статьи
uz: Tanlangan maqolalarni rad etish

source: Convert to draft
ru: Преобразовать в черновик
uz: Qoralamaga aylantirish

source: Reset view counter
ru: Сбросить счётчик просмотров
uz: Ko'rishlar hisoblagichini tiklash

source: No pending articles selected. Only articles with 'Pending Review' status can be approved.
ru: Не выбраны статьи на рассмотрении. Можно одобрить только статьи со статусом 'На рассмотрении'.
uz: Kutilayotgan maqolalar tanlanmagan. Faqat 'Ko'rib chiqish kutilmoqda' holatidagi maqolalarni tasdiqlash mumkin.

source: %(count)d article(s) have been approved and published.
ru: %(count)d статей одобрено и опубликовано.
uz: %(count)d ta maqola tasdiqlandi va nashr etildi.

source: No pending articles selected. Only articles with 'Pending Review' status can be rejected.
ru: Не выбраны статьи на рассмотрении. Можно отклонить только статьи со статусом 'На рассмотрении'.
uz: Kutilayotgan maqolalar tanlanmagan. Faqat 'Ko'rib chiqish kutilmoqda' holatidagi maqolalarni rad etish mumkin.

source: %(count)d article(s) have been rejected.
ru: %(count)d статей отклонено.
uz: %(count)d ta maqola rad etildi.

source: Rejected via bulk action. Please contact admin for details.
ru: Отклонено массовым действием. Свяжитесь с администратором для получения подробностей.
uz: Ommaviy harakat orqali rad etildi. Tafsilotlar uchun administrator bilan bog'laning.

source: %(count)d article(s) converted to draft.
ru: %(count)d статей преобразовано в черновик.
uz: %(count)d ta maqola qoralamaga aylantirildi.

source: View counter reset for %(count)d article(s).
ru: Счётчик просмотров сброшен для %(count)d статей.
uz: %(count)d ta maqola uchun ko'rishlar hisoblagichi tiklandi.

source: Basic Information
ru: Основная информация
uz: Asosiy ma'lumotlar

source: Moderation
ru: Модерация
uz: Moderatsiya

source: Moderation workflow information
ru: Информация о процессе модерации
uz: Moderatsiya ish oqimi haqida ma'lumot

source: Timestamps
ru: Временные метки
uz: Vaqt belgilari

source: No image
ru: Нет изображения
uz: Rasm yo'q

source: Cover Preview
ru: Предпросмотр обложки
uz: Muqova ko'rinishi

source: Reviewer
uz: Taqrizchi

source: Pending Admin Review
uz: Administrator ko'rib chiqishini kutmoqda

source: In Review
uz: Ko'rib chiqilmoqda

source: Changes Requested
uz: O'zgartirishlar so'raldi

source: All Categories Required
uz: Barcha turkumlar talab qilinadi

source: Any Category Sufficient
uz: Bitta turkum yetarli

source: Review Mode
uz: Ko'rib chiqish rejimi

source: How multi-category reviews are evaluated
uz: Ko'p turkumli ko'rib chiqishlar qanday baholanadi

source: Category
uz: Turkum

source: Categories
uz: Turkumlar

source: Name (Uzbek)
uz: Nomi (O'zbekcha)

source: Name (Russian)
uz: Nomi (Ruscha)

source: Name (English)
uz: Nomi (Inglizcha)

source: Description
uz: Tavsif

source: Assigned Reviewers
uz: Tayinlangan taqrizchilar

source: Reviewers who can review articles in this category
uz: Bu turkumdagi maqolalarni ko'rib chiqishi mumkin bo'lgan taqrizchilar

source: Category Policy
uz: Turkum siyosati

source: Category Policies
uz: Turkum siyosatlari

source: Minimum Approvals to Publish
uz: Nashr etish uchun minimal tasdiqlashlar

source: Number of approval votes required
uz: Talab qilinadigan tasdiqlash ovozlari soni

source: Maximum Rejections Before Block
uz: Bloklashdan oldingi maksimal rad etishlar

source: Article is blocked if rejections exceed this
uz: Rad etishlar bundan oshsa maqola bloklanadi

source: Minimum Required Reviews
uz: Minimal talab qilinadigan ko'rib chiqishlar

source: Total reviews needed before decision
uz: Qaror qabul qilishdan oldin kerakli ko'rib chiqishlar soni

source: Allow Admin Override
uz: Administrator bekor qilishiga ruxsat

source: Admin can override policy and publish/reject directly
uz: Administrator siyosatni bekor qilib, to'g'ridan-to'g'ri nashr etishi/rad etishi mumkin

source: Review Deadline (Hours)
uz: Ko'rib chiqish muddati (soat)

source: Optional deadline for reviews
uz: Ko'rib chiqishlar uchun ixtiyoriy muddat

source: Require Comment for Changes
uz: O'zgartirish uchun izoh talab qilish

source: Reviewer must provide comment when requesting changes
uz: O'zgartirish so'raganda taqrizchi izoh berishi shart

source: Require Comment for Rejection
uz: Rad etish uchun izoh talab qilish

source: Reviewer must provide comment when rejecting
uz: Rad etayotganda taqrizchi izoh berishi shart

source: Keyword
uz: Kalit so'z

source: Keywords
uz: Kalit so'zlar

source: Reviewer Assignment
uz: Taqrizchi tayinlash

source: Reviewer Assignments
uz: Taqrizchi tayinlashlari

source: Approved
uz: Tasdiqlangan

source: Review Comment
uz: Ko'rib chiqish izohi

source: Reviewer feedback or comment
uz: Taqrizchi fikr-mulohazasi yoki izohi

source: Assigned At
uz: Tayinlangan vaqt

source: Assigned By
uz: Kim tomonidan tayinlangan

source: Review
uz: Ko'rib chiqish

source: Reviews
uz: Ko'rib chiqishlar

source: Decision
uz: Qaror

source: Approve
uz: Tasdiqlash

source: Request Changes
uz: O'zgartirish so'rash

source: Reject
uz: Rad etish

source: Comment
uz: Izoh

source: You are not assigned to review this category.
uz: Siz bu turkumni ko'rib chiqishga tayinlanmagansiz.

source: Article does not belong to this category.
uz: Maqola bu turkumga tegishli emas.

source: This article cannot be reviewed in its current status.
uz: Bu maqolani joriy holatida ko'rib chiqish mumkin emas.

source: Comment is required when requesting changes.
uz: O'zgartirish so'raganda izoh talab qilinadi.

source: Comment is required when rejecting.
uz: Rad etayotganda izoh talab qilinadi.

source: Title (Uzbek)
uz: Sarlavha (O'zbekcha)

source: Title (Russian)
uz: Sarlavha (Ruscha)

source: Title (English)
uz: Sarlavha (Inglizcha)

source: Content (Uzbek)
uz: Kontent (O'zbekcha)

source: Content (Russian)
uz: Kontent (Ruscha)

source: Content (English)
uz: Kontent (Inglizcha)

source: Published At
uz: Nashr etilgan vaqt

source: Admin Decision By
uz: Administrator qarori

source: Admin Decision At
uz: Administrator qarori vaqti

source: Admin Note
uz: Administrator eslatmasi

source: Upload article file (PDF, DOC, DOCX). Max 20MB.
uz: Maqola faylini yuklang (PDF, DOC, DOCX). Maksimal 20MB.

source: Select at least one category
uz: Kamida bitta turkum tanlang

source: Reviewer Assigned
uz: Taqrizchi tayinlandi

source: Article Submitted
uz: Maqola yuborildi

source: Article For Review
uz: Ko'rib chiqish uchun maqola

source: Review Submitted
uz: Ko'rib chiqish yuborildi

source: Article Published
uz: Maqola nashr etildi

source: Article Resubmitted
uz: Maqola qayta yuborildi

source: Status Changed
uz: Holat o'zgardi

source: General
uz: Umumiy

source: New article submitted for review
uz: Yangi maqola ko'rib chiqish uchun yuborildi

source: Author '%(author)s' has submitted article '%(title)s' for review. Please review and assign reviewers or take action.
uz: '%(author)s' muallifning '%(title)s' maqolasi ko'rib chiqish uchun yuborildi. Iltimos, ko'rib chiqing va taqrizchilarni tayinlang yoki harakat qiling.

source: You have been assigned to review an article
uz: Sizga maqolani ko'rib chiqish tayinlandi

source: You have been assigned by %(admin)s to review the article '%(title)s' by %(author)s. Please review the article and provide your feedback.
uz: %(admin)s tomonidan sizga %(author)s ning '%(title)s' maqolasini ko'rib chiqish tayinlandi. Iltimos, maqolani ko'rib chiqing va fikringizni bildiring.

source: Article resubmitted after changes
uz: O'zgartirishlardan so'ng maqola qayta yuborildi

source: Article '%(title)s' by %(author)s has been resubmitted after making requested changes.
uz: %(author)s ning '%(title)s' maqolasi so'ralgan o'zgartirishlardan so'ng qayta yuborildi.

source: Article has been published
uz: Maqola nashr etildi

source: Article '%(title)s' that you reviewed has been published.
uz: Siz ko'rib chiqqan '%(title)s' maqolasi nashr etildi.

source: Article '%(title)s' by %(author)s has been published.
uz: %(author)s ning '%(title)s' maqolasi nashr etildi.

source: Your article has been published!
uz: Sizning maqolangiz nashr etildi!

source: Congratulations! Your article '%(title)s' has been published and is now visible to readers.
uz: Tabriklaymiz! '%(title)s' maqolangiz nashr etildi va endi o'quvchilarga ko'rinadi.

source: You have been assigned as a Reviewer
uz: Siz taqrizchi sifatida tayinlandingiz

source: You have been assigned as a reviewer (Red Collegiya member). Your assigned categories: %(categories)s. Please visit the Reviewer Dashboard to see articles waiting for your review.
uz: Siz taqrizchi (Red Kollegiya a'zosi) sifatida tayinlandingiz. Sizga tayinlangan turkumlar: %(categories)s. Sizning ko'rib chiqishingizni kutayotgan maqolalarni ko'rish uchun Taqrizchi paneliga tashrif buyuring.

source: New article assigned for review
uz: Ko'rib chiqish uchun yangi maqola tayinlandi

source: Article '%(title)s' by %(author)s has been assigned for your review. Categories: %(categories)s.
uz: %(author)s ning '%(title)s' maqolasi sizning ko'rib chiqishingiz uchun tayinlandi. Turkumlar: %(categories)s.

source: Review received for your article
uz: Maqolangiz uchun ko'rib chiqish olindi

source: Your article '%(title)s' has received a review. Decision: %(decision)s. Category: %(category)s.
uz: '%(title)s' maqolangiz ko'rib chiqildi. Qaror: %(decision)s. Turkum: %(category)s.

source: Comment: %(comment)s
uz: Izoh: %(comment)s

source: Your article has been rejected
uz: Maqolangiz rad etildi

source: Your article '%(title)s' has been rejected.
uz: '%(title)s' maqolangiz rad etildi.

source: Reason: %(reason)s
uz: Sabab: %(reason)s

source: Changes requested for your article
uz: Maqolangiz uchun o'zgartirishlar so'raldi

source: Changes have been requested for your article '%(title)s'. Please review the feedback and make necessary updates.
uz: '%(title)s' maqolangiz uchun o'zgartirishlar so'raldi. Iltimos, fikr-mulohazalarni ko'rib chiqing va zarur yangilanishlarni kiriting.

source: Feedback: %(reason)s
uz: Fikr-mulohaza: %(reason)s

source: Only the author can submit this article.
uz: Faqat muallif bu maqolani yuborishi mumkin.

source: Article cannot be submitted in its current status.
uz: Maqolani joriy holatida yuborib bo'lmaydi.

source: Article submitted successfully.
uz: Maqola muvaffaqiyatli yuborildi.

source: Auto-publish only works when resubmitting after changes requested.
uz: Avtomatik nashr faqat o'zgartirish so'ralgandan so'ng qayta yuborilganda ishlaydi.

source: Article has been published successfully.
uz: Maqola muvaffaqiyatli nashr etildi.

source: Only pending articles can be sent to review.
uz: Faqat kutilayotgan maqolalar ko'rib chiqishga yuborilishi mumkin.

source: Article sent to review successfully.
uz: Maqola ko'rib chiqishga muvaffaqiyatli yuborildi.

source: Reviewers can only be assigned to pending or in-review articles.
uz: Taqrizchilar faqat kutilayotgan yoki ko'rib chiqilayotgan maqolalarga tayinlanishi mumkin.

source: %(count)d reviewer(s) assigned.
uz: %(count)d taqrizchi tayinlandi.

source: Article cannot be published in its current status.
uz: Maqolani joriy holatida nashr etib bo'lmaydi.

source: Article published successfully.
uz: Maqola muvaffaqiyatli nashr etildi.

source: Article cannot be rejected in its current status.
uz: Maqolani joriy holatida rad etib bo'lmaydi.

source: Article rejected.
uz: Maqola rad etildi.

source: Cannot request changes for article in its current status.
uz: Maqolani joriy holatida o'zgartirish so'rab bo'lmaydi.

source: Changes requested from author.
uz: Muallifdan o'zgartirishlar so'raldi.

source: Send to Review (from Pending Admin)
uz: Ko'rib chiqishga yuborish (kutilayotganlardan)

source: Request Changes from Author
uz: Muallifdan o'zgartirishlar so'rash

source: Publish Articles
uz: Maqolalarni nashr etish

source: Reject Articles
uz: Maqolalarni rad etish

source: Reset to Draft
uz: Qoralamaga qaytarish

source: %(count)d article(s) sent to review.
uz: %(count)d maqola ko'rib chiqishga yuborildi.

source: No pending articles selected.
uz: Kutilayotgan maqolalar tanlanmagan.

source: Changes requested for %(count)d article(s).
uz: %(count)d maqola uchun o'zgartirishlar so'raldi.

source: No eligible articles selected.
uz: Tegishli maqolalar tanlanmagan.

source: %(count)d article(s) published.
uz: %(count)d maqola nashr etildi.

source: %(count)d article(s) rejected.
uz: %(count)d maqola rad etildi.

source: %(count)d article(s) reset to draft.
uz: %(count)d maqola qoralamaga qaytarildi.

source: Reviewer Dashboard
uz: Taqrizchi paneli

source: Articles to Review
uz: Ko'rib chiqish uchun maqolalar

source: Your review has been submitted.
uz: Sizning ko'rib chiqishingiz yuborildi.

source: You have already reviewed this article for this category.
uz: Siz bu maqolani bu turkum uchun allaqachon ko'rib chiqqansiz.

source: Access denied. Reviewers only.
uz: Kirish rad etildi. Faqat taqrizchilar uchun.

source: Article "%(title)s" has been submitted for admin review.
uz: "%(title)s" maqolasi administrator ko'rib chiqishi uchun yuborildi.

source: Article "%(title)s" has been published!
uz: "%(title)s" maqolasi nashr etildi!

source: Article "%(title)s" has been resubmitted for review.
uz: "%(title)s" maqolasi qayta ko'rib chiqish uchun yuborildi.

source: Publishability
uz: Nashr etish imkoniyati

source: Ready to Publish
uz: Nashr etishga tayyor

source: Blocked
uz: Bloklangan

source: Review In Progress
uz: Ko'rib chiqilmoqda

source: Article has no categories assigned
uz: Maqolaga turkumlar tayinlanmagan

source: Article is ready for publishing
uz: Maqola nashr etishga tayyor

source: Article is blocked due to rejections in one or more categories
uz: Bir yoki bir nechta turkumlardagi rad etishlar tufayli maqola bloklangan

source: Changes have been requested - waiting for author revision
uz: O'zgartirishlar so'raldi - muallif tuzatishini kutilmoqda

source: %(met)d of %(total)d categories meet policy requirements
uz: %(total)d turkumdan %(met)d tasi siyosat talablariga javob beradi

source: Review in progress
uz: Ko'rib chiqish davom etmoqda

source: Blocked: Too many rejections (%(rejections)d > %(max)d)
uz: Bloklangan: Juda ko'p rad etishlar (%(rejections)d > %(max)d)

source: Changes requested by %(count)d reviewer(s)
uz: %(count)d taqrizchi o'zgartirish so'radi

source: Needs more reviews: %(current)d/%(required)d
uz: Ko'proq ko'rib chiqish kerak: %(current)d/%(required)d

source: Needs more approvals: %(current)d/%(required)d
uz: Ko'proq tasdiqlash kerak: %(current)d/%(required)d

source: Ready for publishing
uz: Nashr etishga tayyor

source: N/A - Article is not in review
uz: Mavjud emas - Maqola ko'rib chiqilmayapti

source: Review Status by Category
uz: Turkumlar bo'yicha ko'rib chiqish holati

source: Biography
uz: Tarjimai hol

source: Organization
uz: Tashkilot

source: Notifications
uz: Bildirishnomalar

source: Mark as Read
uz: O'qilgan deb belgilash

source: No notifications
uz: Bildirishnomalar yo'q

source: Read
uz: O'qilgan

source: Current cover image
ru: Текущее изображение обложки
